Revit 2024 API
LinePatternElement.Create Method
 Creates a new LinePatternElement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static LinePatternElement Create(
	Document document,
	LinePattern linePattern
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	linePattern As LinePattern _
) As LinePatternElement
Visual C++
public:
static LinePatternElement^ Create(
	Document^ document,
	LinePattern^ linePattern
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which to create the LinePatternElement.
linePattern
Type: Autodesk.Revit.DB.LinePattern
 The LinePattern associated to the newly created LinePatternElement.
Return Value
 The newly created LinePatternElement.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The Line Pattern is not valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
LinePatternElement Class
Autodesk.Revit.DB Namespace